[{
    "id": "bidder-truth",
    "name": "Bidder Truth",
    "img": "img/work/bidder-truth.png",
    "description": "Architected and developed a \"purchase experience\" platform backed by an advertisement component. Users could showcase how they achieved the \"best\" deal.",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "Symfony"
    ],
    "website": null
}, {
    "id": "carey-hinoki",
    "name": "Carey Hinoki",
    "img": "img/work/carey-hinoki.png",
    "description": "Designed and developed my porfolio.",
    "alt": "integrated cms using diem-project, added nine box rounded corners",
    "tags": [
        "Diem",
        "HTML & CSS"
    ],
    "website": "//www.careyhinoki.com"
}, {
    "id": "contractor-access",
    "name": "Contractor Access",
    "img": "img/work/contractor-access.png",
    "description": "Managed the maintenance phase of a home grown contractor ecommerce platform. Everything from updating product pages to exporting products to Excel.",
    "alt": "modified credit account submission, modified product listing and detail pages, modified product export mechanism, access database import procedures, integrating with remote mysql server on a windows machine, product image alteration (scaling, thumbnails), cms, minor photoshop, css",
    "tags": [
        "HTML & CSS",
        "PHP"
    ],
    "website": "//www.contractoraccess.com"
}, {
    "id": "curepals",
    "name": "Cure Pals",
    "img": "img/work/curepals.png",
    "description": "Architected and developed a social network for kids with disabilities. The platform revolved around cause awareness.  Subscriptions fees are donationed to organizations that support a user's associated cause.",
    "alt": "entire site architecture, organization management, individual account management, subscription management using authorize.net cim, membership level management, plush doll code subscription management, forums, blogs, faq management, custom cms page creator / management, ajax paginator + filters, ajax login + modals, chat room management, chat room language filter, friends, blocking user, messaging system, interspire shop integration, interest group management, 3rd party flash game integration, profile theme integration",
    "tags": [
        "Authorize.net",
        "HTML & CSS",
        "Javascript",
        "Symfony"
    ],
    "website": "//www.curepals.com/"
}, {
    "id": "dekotile",
    "name": "Dekotile",
    "img": "img/work/deko-tile.png",
    "description": "Created a contest management system that hosted winners and runner-ups for their best tile submissions.  Tied together user photo submissions to a gallery and their respective product pages.",
    "alt": "created a contest system, created a multi step contest submission process, created a gallery, created an admin interface to create / generate monthly contests, created cronjobs to advance monthly contests, created a contest winner system, created a contest runner-up system, created contest user accounts, created a voting system, integrated x-cart variable system, x-cart, css",
    "tags": [
        "HTML & CSS",
        "X-Cart"
    ],
    "website": "//www.dekotile.com/store/"
}, {
    "id": "dressage-online",
    "name": "Dressage Online",
    "img": "img/work/dressage-online.png",
    "description": "Maintained and enhanced the post a listing process. Modified both the PayPal and Constant Contact integrations.",
    "alt": "modification for expiration cronjob, enhanced submission to post listings, modified paypal submissions, constant contact integration alteration, created advanced listing page, cms links, symfony 1.0, css",
    "tags": [
        "Constant Contact",
        "HTML & CSS",
        "PayPal",
        "Symfony"
    ],
    "website": "//www.dressageonline.com/"
}, {
    "id": "endertech",
    "name": "Ender Technology",
    "img": "img/work/endertech.png",
    "description": "Redesigned company website using Joomla 1.5, then Diem 5.0. In addition, I created and designed their internal timecard application.",
    "alt": "entire psd to template integration, joomla 1.5 integration, diem 5.0 integration, custom component creation, html, css",
    "tags": [
        "Diem",
        "HTML & CSS",
        "Javascript",
        "Joomla"
    ],
    "website": "//www.endertech.com/"
}, {
    "id": "ez-flo",
    "name": "EZ-FLO",
    "img": "img/work/ez-flow.png",
    "description": "Managed and maintained a plumbing ecommerce solution. Added product management along with custom components such as file uploading and captchas.",
    "alt": "modified credit account submission, modified product listing and detail pages, modified product export mechanism, access database import procedures, integrating with remote mysql server on a windows machine, custom captcha implementation, pdf uploading, cms, minor photoshop, css",
    "tags": [
        "HTML & CSS",
        "PHP"
    ],
    "website": "//www.ez-flo.net/"
}, {
    "id": "fastnote",
    "name": "Fastnote",
    "img": "img/work/fastnote.png",
    "description": "Architected and developed a reverse twitter-like application. A system where users can post \"notes\" about an individual. In addition, a rules system was created to extensively watch / manage user activity.",
    "alt": "facilitated and architecturally designed entire system, managed team of developers, custom tooltip integration, created note components and listings, created address components and listings, created user registration and profile management, implemented addressee watch system, implemented extensive contact pages, jquery, symfony 1.4, cms, html",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "Symfony"
    ],
    "website": "//www.fastnote.com/"
}, {
    "id": "giumarra",
    "name": "Giumarra",
    "img": "img/work/giumarra.png",
    "description": "Simple content management updates with a hint of flash.",
    "alt": "flash map of current division locations, page content alterations, html, css",
    "tags": "Flash, HTML & CSS",
    "tags": [
        "Flash",
        "HTML & CSS"
    ],
    "website": "//www.giumarra.com/"
}, {
    "id": "giumarra-portal",
    "name": "Giumarra Portal",
    "img": "img/work/giumarra-portal.png",
    "description": "Architected and designed an internal portal application for the Giumarra companies. The application included SSO with custom developed calendar and contact systems.",
    "alt": "architectural designed the entire system, facilitated system creation, implemented single sign on methods with 8+ internal domains, implemented google calendar api, implemented contacts system mimicking google contacts, html, css, symfony 1.0",
    "tags": [
        "Google Contacts",
        "HTML & CSS",
        "Javascript",
        "Symfony"
    ],
    "website": "//www.giumarra.com/"
}, {
    "id": "global-finoncial-data",
    "name": "Global Financial Data",
    "img": "img/work/global-financial-data.png",
    "description": "Redeveloped a specialized system that tracks historical financial data.  Developed charts to discribe splits, dividends, ema, inflation, and more. Also developed screen scrapers that have accounted for tracking 17,000+ stock/indices.",
    "alt": "system was largely redeveloped.  anything not done was done.  anything broken was fixed., modified search functions, modified stock data display (splits, dividends, open - high - low - close - adjusted close), created a permission layer to segment access, hand built a charting system using stock trends / formulas (ema, comparison, inflation, and more), created an array of backend system tools and data uploaders, custom work for both frontend and backend use, created custom shopping cart, custom progress bar, custom zip tools and data download mechanisms, batch scripts for large data source loading, creating reads and parses of 3rd party data, dynamic creation of screen scrapping bots (17000+ bots), heavy html, css",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "PHP"
    ],
    "website": "//www.globalfinancialdata.com/"
}, {
    "id": "idea-marketplace",
    "name": "Idea Marketplace",
    "img": "img/work/idea-marketplace.png",
    "description": "Architected and developed a platform that manages the posting and purchasing of inventive ideas. Users can access three different sections of the application to solve or have their issues solved.",
    "alt": "facilitated and executed entire system, re-architectured system, created a hub for 3 websites (marketplace, competition, community), created custom search system with demographic availability, segmented permissions (buyers, sellers, sponsors, etc), created custom rating system, created custom multi step idea submission system, created batch system, created invitation system, created email notification system, created internal notification system, created messaging system, created an initiative and competition contest system, including winner selection / ranking system, created idea compression and download tool., created comments system, top 10 algorithm integration, created global search system, created what's hot system, heavy html, css, cms, symfony 1.0",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "Symfony"
    ],
    "website": "//www.ideamarketplace.com/"
}, {
    "id": "meow",
    "name": "Meow",
    "img": "img/work/meow.png",
    "description": "Created dozens of custom email blasts. Managed basic maintenance to product and checkout pages.",
    "alt": "product content alterations, checkout modifications, shipping modifications, created numerous custom email blasts, minor html, css",
    "tags": [
        "HTML & CSS",
        "PHP"
    ],
    "website": "//www.meow.com/"
}, {
    "id": "music-works-unlimited",
    "name": "Music Works Unlimited",
    "img": "img/work/music-works-unlimited.png",
    "description": "Basic design integration and maintenance for product pages and also created numerous email blasts.",
    "alt": "created numerous custom email blasts, implemented custom contact uploader, modified product pages, heavy email html, css",
    "tags": [
        "HTML & CSS",
        "PHP"
    ],
    "website": "//www.musicworksunlimited.com/"
}, {
    "id": "mycourthouse",
    "name": "MyCourthouse",
    "img": "img/work/mycourthouse.png",
    "description": "Architected and developed a social network for law students. The application connects students to their organizations by means of events and boards. Each organization is connected to a university or network.",
    "tags": [
        "Diem",
        "Google Calendar",
        "HTML & CSS",
        "Javascript"
    ],
    "website": "//www.mycourthouse.com"
}, {
    "id": "natures-partner",
    "name": "Nature's Partner",
    "img": "img/work/natures-partner.png",
    "description": "Managed site maintenance focused around managing company contacts and emails.",
    "alt": "mass email creation, created contact list parsing of company mailboxes, created custom contact uploader, created custom captcha, modified miscellaneous forms, minor css",
    "tags": [
        "HTML & CSS",
        "PHP"
    ],
    "website": "//www.naturespartner.com/"
}, {
    "id": "oghead",
    "name": "Oghead",
    "img": "img/work/oghead.png",
    "description": "A side business venture that I architected, designed, and developed. A video game social network that ties users together with flash games.",
    "alt": "created and managed entire system development, custom component development to list and display flash games, integration with jomsocial, created cronjob to execute flash downloads via 3rd party json and xml feeds, joomla 1.5, heavy photoshop, heavy html, css",
    "tags": [
        "Design",
        "HTML & CSS",
        "Javascript",
        "Joomla"
    ],
    "website": "//www.oghead.com"
}, {
    "id": "pics-org",
    "name": "PICS",
    "img": "img/work/pics-org.png",
    "description": "Architected and maintained an enterprise level application that handles contractor prequalification. Focusing efforts on secure stable architectures through tech talks and culture change.",
    "alt": "revamped registration, revamped I18N, wrote javascript core architecture, integrated twitter bootstrap, sass, compass, extjs 4",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "Java",
        "Struts 2"
    ],
    "website": "//www.picsorganizer.com"
}, {
    "id": "pics-org-dynamic-report",
    "name": "Dynamic Reporting",
    "img": "img/work/pics-org-dynamic-report.png",
    "description": "Architected and developed a reporting tool in Javascript that manages data from over 100 tables and 40 views.",
    "alt": "extjs 4",
    "tags": [
        "Javascript",
        "Java",
        "Struts 2"
    ],
    "website": null
}, {
    "id": "pics-org-frontend-guide",
    "name": "Frontend Development Guide",
    "img": "img/work/pics-org-frontend-guide.png",
    "description": "Architected and developed a centralized technology tool that encompasses explanations and examples of system architecture, conventions, widgets, etc.",
    "alt": "integrated twitter bootstrap, compass, modernizer, documentated architecture that i created, established standards across html/css/javascript/files",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "Java",
        "Struts 2"
    ],
    "website": null
}, {
    "id": "popasmoke",
    "name": "Popasmoke",
    "img": "img/work/popasmoke.png",
    "description": "Managed and maintained a listing system for veterans that feature photos, comments, and historical accounts that bring each of them closer together.",
    "alt": "modifications to custom forms, image uploading and transformation integration, general debugging and site maintenance, php4 to php5 debugging, database alterations, custom captcha integration, minor html, minor css",
    "tags": [
        "HTML & CSS",
        "PHP"
    ],
    "website": "//popasmoke.com/"
}, {
    "id": "sara-happ",
    "name": "Sara Happ",
    "img": "img/work/sara-happ.png",
    "description": "Simple content alterations and maintenance.",
    "alt": "product detail modifications, product listing debugging, added a merchant seal, modified the sort order of all the products listings and image display, content alteration to featured article, minor html, minor css",
    "tags": [
        "HTML & CSS",
        "PHP"
    ],
    "website": "//www.sarahapp.com"
}, {
    "id": "staff-development-resources",
    "name": "Staff Development Resources",
    "img": "img/work/staff-development-resources.png",
    "description": "Architected and developed as system for finding and listing the highest quality staff development seminars and conferences.",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "Symfony"
    ],
    "website": "//www.sdresources.org/"
}, {
    "id": "hana-shirt-co",
    "name": "The Hana Shirt Co.",
    "img": "img/work/hana-shirt-co.png",
    "description": "Integrated a new product line and built a new shopping cart experience.",
    "alt": "facilitation of system sale component, facilitation of dress component, browser compatibility modifications, addthis.com integration, symfony 1.0, html, minor css",
    "tags": [
        "HTML & CSS",
        "Symfony"
    ],
    "website": "//www.thehanashirtco.com/"
}, {
    "id": "united-oil-co",
    "name": "United Oil Co.",
    "img": "img/work/united-oil-co.png",
    "description": "Facilited the redevelopment of United Oil's marketing site from static html files to a CMS platform.  Managed the development of a gas station location finder.",
    "alt": "facilitation of system conversion from static content into a cms, managed the creation of gas station - location system, custom page requests, database integration with mysql and the company's external data resources, image tranformation integration, browser compatibility checks, symfony 1.2, minor html, minor css",
    "tags": [
        "HTML & CSS",
        "Symfony"
    ],
    "website": "//www.unitedoilco.com/"
}, {
    "id": "united-oil-igi-tv",
    "name": "United Oil - IGI TV",
    "img": "img/work/united-oil-igi-tv.png",
    "description": "Architected and developed a video training software system.  Users get a prioritized queue of videos that was a vehicle for announcements, entertainment, and learning.",
    "alt": "managed and architecturally designed the entire system, facilitated system reporting component, created a method to post videos, implementation of extensive prioritization queue, flowplayer integration, remote uploads on dedicated video server, created a quiz and survey creation wizard, created a quiz and survey component for quizzes, created video library, consistent maintenance, heavy html, css",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "Symfony"
    ],
    "website": null
}, {
    "id": "united-oil-intranet",
    "name": "United Oil - Intranet",
    "img": "img/work/united-oil-intranet.png",
    "description": "In addition to general maintainence I deveoped miscellaneous subsystems that are used within the company.",
    "alt": "created employee directory, created new hire subsystem, miscellaneous intranet development, consistent maintenance, ie6, ie7, ie8 integration, html, css",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "PHP"
    ],
    "website": null
}, {
    "id": "united-oil-pricebook",
    "name": "United Oil - Pricebook",
    "img": "img/work/united-oil-pricebook.png",
    "description": "Architected and facilitated United Oil's transition to an electronic product management system. Created a platform that manages products, vendors, and transactions. Headquarters can upload products, change prices, and create promotions for each of their stations.",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "Symfony"
    ],
    "website": null
}, {
    "id": "united-states-artists",
    "name": "United States Artists",
    "img": "img/work/united-states-artists.png",
    "description": "Architected and facilitated the development a social platform that invests in America's finest artists. Users can list works that can be funded by individuals as well as government grants.",
    "alt": "system facilitation and architectural design, managed development process, created search system, created and maintained function stubs and skeletons, implementation of work profile, implementation of showcase profile, implementation of user profile, addthis.com integration and generalization, symfony 1.3, cms, heavy html, heavy css",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "Symfony"
    ],
    "website": "//www.unitedstatesartists.org"
}, {
    "id": "vintage-vantage",
    "name": "Vintage Vantage",
    "img": "img/work/vintage-vantage.png",
    "description": "Managed the maintenance work of this clothing platform.  Developed and designed custom components and 3rd party api integrations.",
    "alt": "created dynamic custom banner system, custom integration with blogspot feeds, inventory export mechanism development, checkout page modifications, feature system alterations, product page modifications with pagination system, product size, color changes, subdomain migrations, general maintenance, price break maintenance, cms, psd to html, heavy html, css",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "PHP"
    ],
    "website": "//www.vintagevantage.com"
}, {
    "id": "wiki-grads",
    "name": "WikiGrads",
    "img": "img/work/wiki-grads.png",
    "description": "Architected and developed the MVP that created a social experience for students to interact with their classmates.",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "Symfony"
    ],
    "website": "//www.wikigrads.com"
}, {
    "id": "yclipit",
    "name": "Yclipit",
    "img": "img/work/yclipit.png",
    "description": "Developed a search platform for users to search coupon based adventisements around a geographic location.",
    "alt": "search, radial googlemaps search, html / css",
    "tags": [
        "HTML & CSS",
        "Javascript",
        "Symfony"
    ],
    "website": "//www.yclipit.com"
}, {
    "id": "ymspa",
    "name": "Marciena",
    "img": "img/work/ymspa.png",
    "description": "Executed typical content management updates as well as updating images and creating email blasts.",
    "tags": [
        "HTML & CSS",
        "PHP"
    ],
    "website": "//www.ymspa.com"
}]